tutorials/reactingQGDFoam/2D/gasBubble/bubbleR22/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

touch bubbluR22.foam
runApplication blockMesh
runApplication setFields
runApplication `getApplication`

#------------------------------------------------------------------------------
